title = "试前调查问卷 (Python)"
description = """在试前调查问卷中，我们会收集一些您的个人信息、Python知识背景和对大语言模型的了解情况。"""

questions = {
    "基本信息": [
        {
            "text": """大学：根据BCUR中国大学排名，您的大学位于哪个位置？（若不在排行榜上您可以在其他中填写大学名称）。
            <a target='_blank' href='https://www.shanghairanking.cn/rankings/bcur/2024'>https://www.shanghairanking.cn/rankings/bcur/2024</a>
            """,
            "type": "single_choice",
            "options": ["前10名", "10-50名", "50-100名", "100-500名", "500名之外", "不确定/不愿透露", "其他"]
        },
        {
            "text": "专业：您的专业是什么？",
            "type": "textarea",
        },
        {
            "text": "年级：您现在是几年级？",
            "type": "single_choice",
            "options": ["大一", "大二", "大三", "大四", "硕一（直博一年级）", "硕二（直博二年级）", "硕三（直博三年级）", "博一（直博四年级）", "博二（直博五年级）", "不确定/不愿透露", "其他"]
        },
        {
            "text": "您在基础/专业中的大致排名是多少？",
            "type": "single_choice",
            "options": ["前10%", "前20%", "前30%", "低于30%", "不确定/不愿透露"]
        },
        {
            "text": "您是否为第一代大学生：您是您家庭的第一代大学生吗？",
            "type": "single_choice",
            "options": ["是", "否", "不确定/不愿透露"]
        },
        {
            "text": "社会经济地位：您家庭的年收入范围是多少？",
            "type": "single_choice",
            "options": ["低于50,000元", "50,000 - 100,000元", "100,000 - 500,000元", "500,000 - 1,000,000元", "1,000,000 - 10,000,000元", "超过10,000,000元", "不确定/不愿透露"]
        },
        {
            "text": "有关学习问题的方法：在遇到学习问题时，您采用什么方法找到解决方案？（可多选）",
            "type": "multiple_choice",
            "options": ["自己尝试解决", "查询相关文档", "向同学或教师寻求帮助", "在线搜索（例如：百度、谷歌）", "专业技术问答平台（例如：Stack Overflow、GitHub）", "观看学习视频或在线课程（例如：YouTube、Bilibili）", "使用大语言模型寻求帮助（例如：ChatGPT）", "其他"]
        }
    ],
    "知识调查": [
        {
            "text": "编程背景：如果您上过与编程相关的课程，请列出您学过的所有编程语言。（可多选）",
            "type": "multiple_choice",
            "options": ["Java", "C++", "C", "Python", "JavaScript", "Matlab", "R", "SQL", "我没有学过编程", "其他"]
        },
        {
            "text": "编程频率：请问您进行编程的频率？",
            "type": "single_choice",
            "options": ["几乎每天", "几乎每周", "偶尔", "很少，几乎不"]
        }
    ],
    "大语言对话模型的使用": [
        {
            "text": "使用：您之前使用过大语言对话模型(如ChatGPT)吗？",
            "type": "single_choice",
            "options": ["是", "否"]
        },
        {
            "text": "频率：如果是，您使用大语言对话模型(如ChatGPT)来辅助学习的频率是多少？",
            "type": "single_choice",
            "options": ["从不", "很少", "有时", "经常", "总是"]
        },
        {
            "text": "熟悉度：在1-5的评分中，您对大语言对话模型(如ChatGPT)有多熟悉？",
            "type": "single_choice",
            "options": ["1. 不熟悉", "2. 略微熟悉", "3. 一般熟悉", "4. 比较熟悉", "5. 极其熟悉"]
        },
        {
            "text": "影响：您认为大语言对话模型(如ChatGPT)在学习中的影响如何，评分为1-5？",
            "type": "single_choice",
            "options": ["1: 负面影响", "2: 略微负面影响", "3: 没有影响", "4: 积极影响", "5: 极大积极影响"]
        },
        {
            "text": "任务应用：如果是，您使用大语言对话模型(如ChatGPT)完成哪些类型的任务？（可多选）",
            "type": "multiple_choice",
            "options": [
                "进行相关知识的概念解释",
                "得到具体问题的答案和解释",
                "帮助翻译、总结文献",
                "帮助撰写报告或论文",
                "通过交流启发帮助研究",
                "休闲活动",
                "其他"
            ]
        },
        {
            "text": "未使用的原因：如果您没有使用过基于大语言对话模型(如ChatGPT)的平台，主要原因是什么？（可多选）",
            "type": "multiple_choice",
            "options": [
                "我使用过基于大语言对话模型(如ChatGPT)的平台",
                "我不了解基于大语言模型的平台",
                "对答案质量或真实性的担忧",
                "可接入性或连通性问题",
                "可能削弱独立思考能力",
                "被指控剽窃的风险",
                "其他"
            ]
        },
        {
            "text": "潜在风险：您认为使用大语言对话模型(如ChatGPT)进行学习风险有哪些？（可多选）",
            "type": "multiple_choice",
            "options": [
                "我担心过度依赖这类工具，它可能会削弱我的批判性思维和解决问题能力。",
                "我担心这些工具提供的信息可能不够准确或可靠。",
                "我担心使用这些工具可能导致我深度学习不足。",
                "我担心这会减少我与同学/老师之间的人际交流和合作机会。",
                "我认为使用大语言对话模型进行学习没有风险",
                "我不了解基于大语言模型的平台",
                "其他"
            ]
        },
        {
            "text": "期望：您对参与使用大语言对话模型(如ChatGPT)进行学习的效果有什么期望？（可多选）",
            "type": "multiple_choice",
            "options": [
                "提高对相关知识的学习效果",
                "获得对相关知识更深入的理解",
                "在学习过程中有更高的积极性与参度",
                "我不了解基于大语言模型的平台",
                "其他"
            ]
        },
        {
            "text": "使用意愿：您对未来使用大语言对话模型(如ChatGPT)辅助学习的意愿程度如何？",
            "type": "single_choice",
            "options": [
                "非常愿意",
                "比较愿意",
                "中立",
                "不太愿意",
                "完全不愿意",
                "我不了解基于大语言模型的平台"
            ]
        },
        {
            "text": "评估：您认为教育工作者应该如何设计评估以避免滥用大语言对话模型(如ChatGPT)?（可多选）",
            "type": "multiple_choice",
            "options": [
                "设计开放式问题",
                "禁止在学习（包括作业）过程中使用大语言对话模型(如ChatGPT)或任何AI工具",
                "禁止在测验中使用大语言对话模型(如ChatGPT)或任何AI工具",
                "提供关于使用大语言对话模型(如ChatGPT)的指导",
                "提供专用的基于大语言的有限制工具（如不提供具体解决方案）",
                "我不了解基于大语言模型的平台",
                "其他"
            ]
        }
    ]
}
