from database import async_add_user_action
from nicegui import app, ui

CONSENT_FORM = """#### 参与者同意书
**项目名称**：大语言模型在教育中的应用

**主要研究员**： [填入研究员姓名]（[填入机构名称]）

**邀请函**：感谢您抽出时间考虑自愿参加由[填入机构名称]进行的研究项目。本研究的目的是提供有关利用人工智能创建更具交互性和定制化学习环境的见解。

**参与流程**：您的参与是自愿的。如果您选择参与，研究将花费大约3小时，可以在线或线下参加。您将在线完成一份课前调查，其中包括对您编码或数学技能的测试，然后继续参加关于Python代码或博弈论的在线课程（研究人员将分配课程）。根据安排，您在课程期间可能无法访问AI数字学习助手。课程结束后，您将在线完成一份课后调查。总的来说，您的参与将花费大约2小时。

注意：参与者一旦进入课程的每个阶段，就不允许退出（预计持续时间将在您选择开始前显示）；他们必须在规定时间内完成并返回进度页面。但是，参与者可以在进度页面停留最多20分钟，然后再继续下一阶段。（这20分钟不包括在总实验时间内。）

在研究期间，我们计划收集有关您的以下信息：

- 大学排名
- 专业
- 年级
- 成绩排名
- 收入范围
- 对大型语言模型的看法和使用情况
- 数学和编程技能
- 您在与我们的在线作业平台交互时输入和点击的日志
- 您在我们平台上的体验和对其功能的评估的主观描述
- 您对在教育中应用大型语言模型的看法

屏幕录制是必需的，以确保参与者在完成课程作业时不使用外部工具。屏幕录像不会显示您的脸。远程参与的参与者将在会话开始时被提醒关闭显示可识别或私人信息的任何应用程序并静音任何通知（例如电子邮件弹出窗口）

**报酬**：根据参与者学习课程材料的表现提供额外激励，其中表现指标定义为：20％ * 作业1的得分 *（1+作业1的速度）+ 30％ * 作业2的得分 *（1+作业2的速度）。排名前10％的人将获得额外200元人民币的激励。排名在10％至40％范围内的人将获得100元人民币的激励。

**好处**：参与此研究不会直接给您带来好处。

我们希望本研究的发现将有助于更好地了解大型模型是否以及如何帮助学生学习，并减少教育中的不平等。

**风险**：参与的风险类似于您在执行日常任务时可能经历的风险。风险包括疲劳，考试焦虑或回答敏感问题时的不适。您可以跳过任何您不愿意回答的问题。在您的信息被去标识后，根据数据中的独特特征，有可能重新识别个人，但我们正在采取多种预防措施，包括以下措施：我们不会在研究团队之外共享屏幕录像，我们将以总体报告结果（将个人回答组合在一起以显示结果），并使用一串代码而不是您的姓名标记记录。

**隐私和机密性**：研究人员将尽可能保密您的参与和您分享的信息。

您分享的信息，包括屏幕录像，将在我们的记录中用一串代码而不是您的姓名或其他直接标识符进行标记。该代码的密钥将单独存储，并在数据收集完成后销毁。

屏幕录像将保留，直到我们验证参与者没有使用外部资源来完成研究任务，然后将其删除。这将在最终撰写研究报告前完成，或在两年内完成，以先到者为准。

研究人员可能会公开分享这项研究的结果，例如在期刊文章或会议演讲中，但不会透露您的个人信息。

在这项研究中收集的信息可能用于未来的研究研究。

如果发生这种情况，研究人员将在使用或共享之前删除任何直接标识符，例如您的姓名或电子邮件地址。

如果您决定退出研究，并希望研究人员删除您的研究信息，您可以通过[[填入联系邮箱]]([填入联系邮箱])与团队联系，我们将在3个工作日内删除屏幕录像、您填写的问卷的回答（包括大学排名、专业、年级、成绩排名、收入范围、对大型语言模型的看法和使用情况、数学和编程技能测试的回答、您在我们平台上的体验和对其功能的评估的主观描述和您对在教育中应用大型语言模型的看法）和平台交互记录。但是，在我们将研究结果整理并发布到期刊文章或会议后，将不再可能从论文中展示的结果中删除您的信息。但研究结果是以总体报告结果（将个人回答组合在一起以显示结果），不会泄漏您的个人信息。

**利益冲突声明**：本研究项目由[填入机构名称]资助。

**参与是您的选择**：您的参与是自愿的。您是否参与完全取决于您。您现在可以决定参与，也可以稍后停止参与。您是否参与的决定不会对您与[填入机构名称]在本研究之外的任何其他服务或协议产生影响。

**问题或疑虑**：如果您在任何时候对本研究有任何问题或疑虑，您可以通过[[填入联系邮箱]]([填入联系邮箱])与研究团队联系。如果您对作为研究参与者的权利有任何疑问， 请联系[填入机构名称]机构审查委员会[[填入联系邮箱]]([填入联系邮箱])。

**同意**：您是否愿意按照上述描述参加本研究？
"""


class ConsentPageBuilder:
    def __init__(self, cfg, user=None):
        self.cfg = cfg
        self.user = user
        self.username = user.get("username")

    def build(self):
        async def submit_consent():
            if radio1.value == "是的，我愿意参与。":
                await async_add_user_action(
                    username=self.username, action="consent", value={"agree": True}
                )
                ui.navigate.to("/progress")
            elif radio1.value == "不，谢谢。":
                app.storage.user.clear(), ui.navigate.to("/login")
            else:
                ui.notify("请选择一个选项", color="negative")

        with ui.column().classes(
            "w-full grid grid-cols-12"
        ):  # .classes("w-full h-screen grid grid-cols-11") as col:
            with ui.column().classes(
                "grid grid-cols-12 col-start-2 col-end-11 bg-white rounded-lg shadow-lg py-8"
            ):
                with ui.column().classes("col-start-2 col-end-12"):
                    ui.markdown(CONSENT_FORM)
                with ui.column().classes("col-start-2 col-end-12"):
                    radio1 = ui.radio(["是的，我愿意参与。", "不，谢谢。"])

                with ui.column().classes("col-start-2 col-end-12"):
                    ui.html("""如果您想保留此同意表的副本，请立即打印或保存一份。""")

                with ui.column().classes("col-start-2 col-end-12"):
                    ui.button("提交", on_click=submit_consent)
