description = """
## 耶鲁博弈论课堂游戏
课堂上老师给同学“甲”、“乙”两种选择，请每位同学准备一张字条，选择并写下其中之一；两人随机分为一组，但事先相互不知道对方是谁；最终每人会得到一个分数结果：
1. 如果我方选“甲”而对方选“乙”，那么我方得3分，对方得-1分；
2. 如果我方选“乙”而对方选“甲”，那么我方得-1分，对方得3分；
3. 如果我们都选“甲” ，那么都得0分；
4. 如果我们都选“已” ，那么都得1分。

（1）下面为该博弈问题的收益矩阵，请为每个单元格填写双方的收益值。（1分）

| 我方/对方 | 甲 | 乙 |
| --- | --- | --- |
| 甲 | `A1`,`A2` | `B1`,`B2` |
| 乙 | `C1`,`C2` | `D1`,`D2` |

请填写`A1`, `A2`, `B1`, `B2`, `C1`, `C2`, `D1`, `D2`的内容。

（2）使用重复严格剔除劣战略分析，哪些战略不会被剔除? （1.5分）

A：（甲，甲）B：（甲，乙）C：（乙，甲）D：（乙，乙）

你的选项是：`填空1`。

（3）使用划线法分析，纯战略纳什均衡是什么?（1.5分）

A：（甲，甲）B：（甲，乙）C：（乙，甲）D：（乙，乙）

你的选项是：`填空2`

"""

math_template = """
（1）A1: []; A2: []; B1: []; B2: []; C1: []; C2: []; D1: []; D2: []。

（2）填空1: []。

（3）填空2: []。
"""

knowledge = ["express", "dominated", "finite_nash"]

title = "耶鲁课堂游戏（4分）"
score = 4

answer = """
（1）这个博弈问题的收益矩阵为

| 我方/对方 | 甲   | 乙   |
| --------- | ---- | ---- |
| 甲        | 0,0  | 3,-1 |
| 乙        | -1,3 | 1,1  |

因此A1：0，A2：0，B1：3，B2：-1，C1：-1，C2：3，D1：1，D2：1。

（2）对于我方和对方来说，乙都严格劣于甲。因此只有（甲，甲）不会被剔除。填空1为（甲，甲）。

（3）用划线法处理的收益矩阵如下

| 我方/对方 | 甲                | 乙          |
| --------- | ----------------- | ----------- |
| 甲        | <u>0</u>,<u>0</u> | <u>3</u>,-1 |
| 乙        | -1,<u>3</u>       | 1,1         |

这个博弈的纯战略纳什均衡（填空2）为（甲，甲）。
"""
