description = r"""
## 分配一元
两个人就如何分配一元钱进行谈判，双方同时提出各自希望得到的份额，分别为\\(s_1\\)和\\(s_2\\) ，且 \\(0 \leq s_1, s_2 \leq 1 \\)。 若 \\(s_1 + s_2 ≤ 1\\) ，则二人分别得到他们所要的一份；如果\\(s_1+s_2>1\\)，则两个人均 一无所获。求出此博弈的纯战略纳什均衡。 （5分）

$$
u_i(s_i, s_j) = \\begin{cases}
[[填空1]], s_1 + s_2 ≤ 1 \\\\
[[填空2]], s_1 + s_2 > 1
\\end{cases}
$$

由纳什均衡的定义可知\\(s_i^\* = \\arg\max_{0 \leq s_i \leq 1} u_i(s_i, s_j^\*)\\)

解该优化问题可得：`填空3`

因此本题中的纯战略纳什均衡为`填空4`。
"""

math_template = """
填空1: [];

填空2: [];

填空3: [];

填空4: []。
"""

knowledge = ["express", "inf_nash"]


title = "分配一元（5分）"
score = 5

answer = r"""
设参与者i的收益函数为\\(u_i(s_i, s_j)\\)，\\(u_i(s_i, s_j)\\)的形式如下

$$
u_i(s_i, s_j) = \\begin{cases}
s_i, &s_i + s_j \\leq 1, \\\\
0, &s_i + s_j > 1.
\\end{cases}
$$

由纳什均衡的定义可知\\(s_i^\* = \\arg\\max_{0 \\leq s_i \\leq 1} u_i(s_i, s_j^\*)\\)

易得\\(s_i^\* = 1 - s_j^\*\\)。因此本题中有无数个纯战略纳什均衡，满足\\(s_i^\*+ s_j^\*= 1\\)的点均为纯战略纳什均衡。

因此填空1为\\(s_i\\)，填空2为0，填空3为\\(s_i^\* = 1 - s_j^\*\\)，填空4为满足\\(s_i^\*+ s_j^\*= 1\\)的点。
"""
