description = r"""
## 贝特兰德的双头垄断模型
我们考虑两种有差异的产品。 如果企业1和企业2分别选择价格\\(p_1\\)和\\(p_2\\)，消费者对企业\\(i\\)的产品的需求为:

$$
q_i(p_i, p_j) = a - p_i + bp_j
$$

其中\\(b>0\\)，即只限于企业\\(i\\)的产品为企业\\(j\\)产品的有差异替代品的情況。假设企业生产没有固定成本，并且边际成本为常数c，求出此博弈的纯战略纳什均衡。（7分）

提示： 固定成本是指在一定产量范围内，不随产量的增减而变化的成本。例如，租金、管理人员工资、折旧费用等。边际成本是指生产额外一单位产品时所增加的总成本。它是总成本对产量的导数。

请完成下列填空：

设企业i的收益函数为\\(u_i(p_i, p_j)\\)，根据题目描述可写出其具体形式为：

$$
u_i(p_i, p_j) = [[填空1]]
$$

为贝特兰德模型的纯战略纳什为\\(p_1^\*=\\)`填空2`，\\(p_2^\*=\\)`填空3`

"""

math_template = """
填空1: [];

填空2: [];

填空3: []。
"""

title = "贝特兰德模型（7分）"
score = 7

knowledge = ["express", "inf_nash"]

answer = r"""
设企业i的收益函数\\(u_i(p_i, p_j)\\)，由题目描述可知

$$
u_i(p_i, p_j) = q_i \\times (p_i - c) = (a - p_i + bp_j)(p_i -c).
$$

由纳什均衡的定义可知, \\(p_i^\*\\)为下面最优化问题的解

$$
p_i^* = \\arg\\max_{p_i \\geq 0} u_i(p_i, p_j^\*).
$$

求解上述最优化问题，等价于求解下面的约束方程

$$
\\frac{\\partial u_i(p_i, p_j^\*)}{\\partial p_i} = a - p_i +b p_j^\*-p_i+c = a+c+bp_j^\*-2p_i = 0,\\\\
\\frac{\\partial^2 u_i(p_i, p_j^\*)}{\\partial {p_i}^2} = -2 < 0.
$$

可得

$$
\\begin{cases}
a+c+bp_2^\* - 2p_1^\* &= 0,\\\\
a+c+bp_1^\* - 2p_2^\* &= 0.\\\\
\\end{cases}
$$

解上述方程可得\\(p_1^\* = p_2^\* = \\frac{a+c}{2 - b}\\)为贝特兰德模型的纯战略纳什均衡。

由上述解答过程可知，填空1为\\(q_i \\times (p_i - c) = (a - p_i + bp_j)(p_i -c).\\)，填空2和3均为\\(\\frac{a+c}{2 - b}\\)。
"""
