description = r"""
## 狩猎博弈
两名猎人一起去打猎，他们可以猎取鹿，也可以猎取野兔。鹿需要两个人合作才能获取，野兔一个人就可猎得，但猎鹿所得的收益大于猎野兔所得的收益。假设猎得鹿的收益为x，猎得兔的收益为y。

（1）这个狩猎博弈问题的参与者是`填空1`和`填空2`。每个参与者可以选择的战略是`填空3`和`填空4`。（1分）

（2）狩猎博弈问题的收益矩阵如下：

| `填空1`/`填空2`   | `填空3` | `填空4` |
| -------- | -------- | -------- |
| `填空3` | `A1`,`A2`    | `B1`,`B2`    |
| `填空4` | `C1`,`C2`    | `D1`,`D2`    |

请填写`A1`, `A2`, `B1`, `B2`, `C1`, `C2`, `D1`, `D2`的内容，狩猎博弈的纯战略纳什均衡为`填空5`。（2分）
"""

math_template = """（1）填空1: []; 填空2: []; 填空3: []; 填空4: []。

（2）A1: []; A2: []; B1: []; B2: []; C1: []; C2: []; D1: []; D2: []; 填空5: []。
"""

knowledge = ["express", "finite_nash"]

title = "狩猎博弈（3分）"

score = 3

answer = """（1）参与者是猎人1和猎人2。每个参与者可以选择的战略有猎鹿、猎兔。

（2）狩猎博弈问题的收益矩阵，并使用划线法处理如下:

| 猎人1/猎人2 | 猎鹿            | 猎兔          |
| ----------- | --------------- | ------------- |
| 猎鹿        | <u>x</u>,<u>x</u>  | 0,y           |
| 猎兔        | y,0             | <u>y</u>,<u>y</u> |

因此狩猎博弈问题的纳什均衡为（猎鹿，猎鹿）和（猎兔，猎兔）
"""
