description = r"""
## 最后要价仲裁
一企业和工会在工资问题上有争议，双方将各自出价，最后由第三方仲裁人解决。企业和工会同时开出自己希望的工资水平，分别用 \\(w_1\\) 和 \\(w_2\\) 表示（\\(w_1<w_2\\)），仲裁人在二者之中选择其一作为结果。假定仲裁人本身对工资水平有自己认为合理的方案，用 \\(x\\) 来表示这一理想值，且仲裁人只是简单选择距离 \\(x\\) 最接近的要价。仲裁者知道 \\(x\\) 而另外两方不知道，他们相信 \\(x\\) 是一个随机变量，其累积分布函数为 \\(F(x)\\)，相应的概率密度函数为 \\(f(x)\\)。

（1）工资水平的期望为`填空1`。(2分)

（2）设 \\(w_1^\*,w_2^\*\\) 是企业和工会间博弈的纳什均衡，均衡条件为`填空2`（以分布函数的形式呈现）。(6分)
"""

math_template = """（1）填空1: []; 。

（2）填空2: []。
"""
knowledge = ["express", "finite_nash"]

title = "最后要价仲裁（8分）"

score = 8

answer = r"""
（1） 由于\\(P(w_1被选) = P(x < \\frac{w_1+w_2}{2}) = F(\\frac{w_1+w_2}{2})\\)

工资水平的期望为\\(E[w] = w_1 * F(\\frac{w_1+w_2}{2}) + w_2 * [1-F(\\frac{w_1+w_2}{2})]\\)。

（2）企业和工会的纳什均衡 \\((w_1^\*, w_2^\*)\\) 满足条件为：

$$
w_1^* = \\arg\\min_{w_1} w_1 \* F(\\frac{w_1+w_2^\*}{2}) + w_2^\* \* [1-F(\\frac{w_1+w_2^\*}{2})]
$$

$$
w_2^* = \\arg\\max_{w_2^\*} w_1^\* \* F(\\frac{w_1^\*+w_2}{2}) + w_2 \* [1-F(\\frac{w_1^\*+w_2}{2})]
$$

对上述条件求一阶导数可得：

$$
(w_1^\* - w_2^\*)\*\\frac{1}{2} f(\\frac{w_1^\*+w_2^\*}{2}) = F(\\frac{w_1^\*+w_2^\*}{2})
$$

$$
(w_1^\* - w_2^\*)\*\\frac{1}{2} f(\\frac{w_1^\*+w_2^\*}{2}) = 1 - F(\\frac{w_1^\*+w_2^\*}{2})
$$

这表明 \\(F(\\frac{w_1^\*+w_2^\*}{2}) = \\frac{1}{2}\\)。即双方要价的平均值一定等于仲裁者偏好方案的中值。同时，易得

$$
(w_1^\* - w_2^\*) = \\frac{1}{f(\\frac{w_1^\*+w_2^\*}{2})}
$$

"""
