description = r"""
## 鹰鸽博弈
在自然界中，动物之间的互动可以被视为一种博弈。例如，当两只鹰同时发现一份食物时，它们的天性决定它们会展开激烈的争斗，最终可能导致两败俱伤，因此两只鹰的收益都是 -2。当两只鸽子相遇时，它们的天性使它们倾向于和平共享食物，因此它们各自的收益都是 1。然而，当一只鹰和一只鸽子相遇时，鸽子会选择逃跑，而鹰则独占所有食物，此时鹰的收益为 2，而鸽子的收益为 0。现假设两只鸟相遇。

（1）鹰鸽博弈问题的参与者是`填空1`和`填空2`。每个参与者可以选择的战略是`填空3`和`填空4`。（1分）

（2）鹰鸽博弈问题的收益矩阵如下：

| `填空1`/`填空2`   | `填空3` | `填空4` |
| -------- | -------- | -------- |
| `填空3` | `A1`,`A2`    | `B1`,`B2`    |
| `填空4` | `C1`,`C2`    | `D1`,`D2`    |

请填写`A1`, `A2`, `B1`, `B2`, `C1`, `C2`, `D1`, `D2`的内容，鹰鸽博弈的纯战略纳什均衡为`填空5`。（2分）
"""

math_template = """（1）填空1: []; 填空2: []; 填空3: []; 填空4: []。

（2）A1: []; A2: []; B1: []; B2: []; C1: []; C2: []; D1: []; D2: []; 填空5: []。
"""

knowledge = ["express", "finite_nash"]

title = "鹰鸽博弈（3分）"
score = 3

answer = """
（1）参与者是鸟类1和鸟类2。每个参与者可以选择的战略有鹰策略、鸽策略。

（2）鹰鸽博弈收益矩阵，并使用划线法处理如下:

| 鸟类1\鸟类2    | 鹰策略      | 鸽策略      |
| ------- | ----------- | ----------- |
| 鹰策略  | -2, -2      | <u>2</u>, <u>0</u>        |
| 鸽策略  | <u>0</u>, <u>2</u>        | 1, 1        |

因此鹰鸽博弈问题的纳什均衡为（鹰策略，鸽策略）和（鸽策略，鹰策略）。
"""
