description = r"""
## 拾遗博弈
某公司法定代表人A去签订某项订单合同，预期该订单能为公司创造10万元的利润，然而不幸的是，某合同要件遗失在途中，被路人B拾到。若A不能及时找到B取回，就意味着该订单流产，潜在的商誉损失3万元；而对于B来说此合同要件毫无价值。
A通过某种方式联系到了B，并且双方都清楚文件对A的重要性和对B的无价值性。此时，B面临两种选择：

* 要求2万元的酬金归还文件。若采取此策略，B将获得2万元的经济收益，但会承受道德压力，假设这种道德压力相当于承受1.5万元的精神损失。
* 无偿归还文件，没有经济收益，但会获得精神上的满足，假设这种精神满足价值1.5万元。

A的选择是：

* 同意支付2万元的酬金取回文件，总损失为2万元（而无其他损失，因为支付酬金避免了3万元的商誉损失和10万元的利涊损失）。
* 放弃文件，直接承担13万元的总损失。


（1）拾遗博弈的收益矩阵如下：

| A/B   | 要酬谢 | 不要酬谢 |
| -------- | -------- | -------- |
| 取回 | `A1`,`A2`    | `B1`,`B2`    |
| 不取回 | `C1`,`C2`    | `D1`,`D2`    |

请填写`A1`, `A2`, `B1`, `B2`, `C1`, `C2`, `D1`, `D2`的内容 （1分）

(2) 拾遗博弈的纯战略纳什均衡为`填空1`。（1分）
"""

math_template = """（1）A1: []; A2: []; B1: []; B2: []; C1: []; C2: []; D1: []; D2: [];

（2）填空1: []。
"""

knowledge = ["express", "finite_nash"]

title = "拾遗博弈（2分）"

score = 3

answer = """
（1）拾遗博弈的收益矩阵如下:

| A/B         | 要酬谢        | 不要酬谢       |
| ----------- | ------------- | -------------- |
| 取回        | 8, 0.5       | 10, 1.5          |
| 不取回      | -3, -1.5        | -3, 1.5        |

（2）使用划线法处理如下:

| A/B         | 要酬谢        | 不要酬谢       |
| ----------- | ------------- | -------------- |
| 取回        | <u>8</u>, 0.5   | <u>10</u>, <u>1.5</u>  |
| 不取回      | -3, -1.5        | -3, <u>1.5</u>        |

因此拾遗博弈的纯战略纳什均衡为（取回，不要酬谢）。

"""
