description = r"""
## 市场壁垒
在一个市场中，存在两家公司（甲和乙），这两家公司都在考虑是否要提高市场壁垒来阻止新竞争者的进入。如果一家公司决定增加壁垒而另一家不这么做，那么增加壁垒的公司将获得更高的市场份额（收益为3），而另一家公司的市场份额将略微减少（收益为1）。如果两家公司都不增加壁垒，他们将保持当前的市场份额（收益为2）。但是，如果两家公司都试图增加壁垒，他们将相互竞争导致成本过高，收益都为0。

（1）这个市场壁垒问题的参与者是`填空1`和`填空2`。每个参与者可以选择的战略是`填空3`和`填空4`。（1分）

（2）市场壁垒问题的收益矩阵如下：

| `填空1`/`填空2`   | `填空3` | `填空4` |
| -------- | -------- | -------- |
| `填空3` | `A1`,`A2`    | `B1`,`B2`    |
| `填空4` | `C1`,`C2`    | `D1`,`D2`    |

请填写`A1`, `A2`, `B1`, `B2`, `C1`, `C2`, `D1`, `D2`的内容，市场壁垒的纯战略纳什均衡为`填空5`。（2分）
"""

math_template = """（1）填空1: []; 填空2: []; 填空3: []; 填空4: []。

（2）A1: []; A2: []; B1: []; B2: []; C1: []; C2: []; D1: []; D2: []; 填空5: []。
"""

knowledge = ["express", "finite_nash"]

title = "市场壁垒问题（3分）"

score = 3

answer = """
（1）参与者是甲和乙。每个参与者可以选择的战略有增加壁垒、不增加壁垒。

（2）市场壁垒问题的收益矩阵经划线法处理如下:

| 甲/乙    | 增加壁垒          | 不增加壁垒          |
| -------- | ----------------- | ----------------- |
| 增加壁垒 | 0,0               | <u>3</u>,<u>1</u> |
| 不增加壁垒 | <u>1</u>,<u>3</u> | 2,2               |

因此A1：0，A2：0，B1：3，B2：1，C1：1，C2：3，D1：2，D2：2。

由划线法可得市场壁垒的纯战略纳什均衡为（增加壁垒，不增加壁垒）和（不增加壁垒，增加壁垒）。
"""
