description = r"""
## 信任博弈
两名参与者进行信任博弈。信任者（玩家1）拥有10单位的资源。他可以选择将这些资源中的一部分(\\(0 \\leq x \\leq 10\\))交给受托者（玩家2），交出的资源会被放大3倍。然后受托者可以选择返还一部分资源(\\(y\\leq 3x\\))给信任者。

（1）玩家1的收益函数\\(u_1(x, y)\\)为`填空1`，玩家2的收益函数\\(u_2(x, y)\\)为`填空2`。（1分）

（2）信任博弈的纯战略纳什均衡为`填空3`。（3分）
"""

math_template = """（1）填空1: []; 填空2: []。

（2）填空3: []。
"""

knowledge = ["finite_nash"]

title = "信任博弈（4分）"
score = 4

answer = r"""
(1) 玩家1的收益函数\\(u_1(x, y) = 10 - x + y\\), 玩家2的收益函数\\(u_2(x, y) = 3x - y\\),

(2) 玩家2最大化收益函数会将返回值设置为0：

$$
y^\* = \\arg\\max_{y} u_2(x^\*, y) = 0
$$

由于\\(y^\*=0\\)， 玩家1最大化收益也会将交出资源值设置为0：

$$
x^\* = \\arg\\max_{x} u_1(x, y^\*) = 0
$$

因此信任博弈的纯战略纳什均衡为(0,0)。
"""
