description = r"""
## 猜均值的三分之二
在一个游戏中，n参与者被要求每人同时给出一个[0,360]的数字，所给出的数字最接近平均值2/3的那个人将会是获胜者。参与者之间并不知道其他人的选择。假设所有人都是理性人，理性人的最终选择会是什么数字？

（1）设第i名参与者给出的数字为\\(x_i\\), 本题的收益函数为\\(u_i(x_1, ..., x_n)\\) = `填空1` （1分）

（2）本博弈问题的纯战略纳什均衡为`填空2`。（3分）
"""

math_template = """（1）填空1: []。

（2）填空2: []。
"""

knowledge = ["finite_nash"]

title = "猜均值的三分之二（4分）"
score = 4

answer = r"""
设所有参与者i的给出数字的均值为\\(\\bar{x}=\\frac{1}{n}\\sum{x_i}\\)，\\(u_i(x_1, ..., x_n)\\)的形式如下

$$
u_i(x_1, ..., x_n) = \\begin{cases}
1, &x_i最接近\\frac{2}{3}\\bar{x}, \\\\
0, &其他.
\\end{cases}
$$

由纳什均衡的定义可知\\(x_i^\* = \\arg\\max_{x_i} u_i(x_1^\*, ..., x_n^\*))\\), 易得\\(x_i^\* = \\frac{2}{3}\\bar{x}^\*\\)。

联立方程，将等式两侧对\\(x_1\\)至\\(x_n\\)进行累加后平均可得，\\(\\bar{x}^\*=\\frac{2}{3}\\bar{x}^\*\\)。

因此\\(\\bar{x}^\*=0\\), 由\\(x_i\\)为大等于0的数可知，本博弈问题的纯战略纳什均衡为\\(x_i^\* = 0\\)。
"""
