description = r"""
## 分割者-选择者博弈
A 和 B 在分享一块蛋糕。巧克力棒可以均匀地划分成不同的份额。A先将蛋糕分割为两份之后，B是选择一份。两人都想获得更多的蛋糕。假设A分割的份额为\\(x\\)和\\(1-x\\) (\\(x\\leq0.5\\))。

（1）A的收益函数\\(u_A\\)为`填空1`，B的收益函数\\(u_B\\)为`填空2`。（3分）

（2）本问题的纯战略纳什均衡为`填空3`。（2分）
"""

math_template = """（1）填空1: []; 填空2: []; 。

（2）填空3: []。
"""

knowledge = ["infinite_nash"]

title = "分割者-选择者博弈（5分）"

score = 5

answer = r"""
（1）\\(u_A(x)\\)的形式如下：

$$
u_A(x) = \\begin{cases}
x, &B选择1-x, \\\\
1-x, &B选择x.
\\end{cases}
$$

\\(u_B(x)\\)的形式如下：
$$
u_B(x) = \\begin{cases}
1-x, &B选择1-x, \\\\
x, &B选择x.
\\end{cases}
$$


（2） 由于B要最大化自己的收益，他一定会选择\\(1-x^\*\\)，而A会选择\\(x^\*\\)。由于A会最大化\\(x^\*\\)，可知\\(x^\*=0.5\\)。

"""
