description = r"""
## 贝特兰德模型2
假设有两家公司1和公司2，在一个市场上销售同质化产品。每家公司可以设定自己的价格 \\(p_1\\) 和 \\(p_2\\)。消费者总是选择价格较低的公司购买产品。如果两家公司的价格相同，消费者将平分给两家公司。每家公司的成本是固定的，为常数\\(c\\)，并且市场需求量是 \\(D(p)=D_0-k \cdot p\\)，其中 \\(p\\) 是市场上的最低价格，\\(D_0\\) 和 \\(k\\) 是已知常数。

（1）两家公司的收益函数为\\(u_i(p_i, p_j)\\)=`填空1`。(2分)

（2）本问题的纯战略纳什均衡为`填空2`。（4分）
"""

math_template = """（1）填空1: []; 。

（2）填空2: []。
"""

knowledge = ["finite_nash"]

title = "贝特兰德模型2（6分）"

score = 6

answer = r"""
（1）\\(u_i(p_i, p_j)\\)的形式如下：

$$
u_i(p_i, p_j) = \\begin{cases}
(D_0 - kp_i)(p_i - c), &p_i < p_j, \\\\
(D_0 - kp_i)\\frac{p_i - c}{2}, &p_i = p_j, \\\\
0, &p_i > p_j, \\\\
\\end{cases}
$$

（2） 由于\\(u_i\\)的最大值在\\(p_i < p_j\\)时取到， 每一方理论上都倾向于定价低于对方但无限接近对方，从而占据整个市场。

简单证明(c,c)为唯一的纳什均衡。

首先，给定对方定价c，己方定价c时，利润为0。而己方定价高于c时，利润为0，低于c时，利润为负。所以给定对方定价c，己方定价c是最优反应，这对于双方都成立，也即(c,c)是纳什均衡。

其次，由于不存在固定成本，所以市场中企业的定价不可能低于c。而双方定价都高于c时，每一方理论上都倾向于定价低于对方但无限接近对方，从而占据整个市场，从而此时没有稳定的均衡；而一方定价高于c、另一方定价为c同样不够成稳定均企业更倾向于定价高于c但低于另一方的定价。由此，可以证明纳什均衡(c,c)的唯一性。
"""
