description = r"""
## 公共财问题
某村庄有 3 个村民，在公共草地上放牧。每位村民放牧的羊的数量分别是 \\(g_1, g_2, g_3\\)。设草地放羊的上限为 \\(G_{max} = 10\\)，超过这个数量草地会变得不堪重负，每只羊的价值将变为0。设每只羊的成本为 \\(c=4\\)。每只羊的价值 \\(v(G)\\) 随着放牧总数 \\(G\\) 的增加而减小，具体为 \\(v(G) = 20 - 2G\\)，仅在 \\(G < G_{max}\\) 时成立，否则 \\(v(G) = 0\\)。

（1）村名i的收益函数\\(u_i(g_i, g_j, g_k)\\) = `填空1`。（2分）

（2）假设\\(g_j=g_j^\*\\), \\(g_k=g_k^\*\\)已知，村名i最大化自己的利益时需要放羊的数量为`填空2`。（2分）

（3）公共财问题的纯战略纳什均衡为`填空3`。（2分）
"""

math_template = """（1）填空1：[]

（2）填空2：[]

（3）填空3：[]
"""

knowledge = ["finite_nash"]

title = "公共财问题（6分）"

score = 6

answer = r"""
（1）\\(u_i(g_i, g_j, g_k)\\)的形式如下：

$$
u_i(g_i, g_j, g_k) = \\begin{cases}
g_i(16 - 2G), &g_i + g_j + g_k \\leq 10, \\\\
-4g_i, &g_i + g_j + g_k > 10, \\\\
\\end{cases}
$$

(2) 已知\\(g_j=g_j^\*\\), \\(g_k=g_k^\*\\)时，

$$
g_i^* = \\arg\\max_{g_i} u_i(g_i, g_k^\*, g_j^\*))
$$

当\\(g_i + g_j^\* + g_k^\* \\leq 10\\)时，
$$
\\frac{\\partial u_i(g_i, g_j^\*, g_k^\*)}{\\partial g_i} = 16 - 2G^\* - 2g_i^\* = 16 - 2g_j^\* - 2g_k^\* - 4g_i^\* = 0
$$

$$
g_i^\* = 4 - \\frac{g_j^\* + g_k^\*}{2}
$$


（3） 联立方程，可得\\(G = 12 - G\\)，因此\\(G = 6\\), \\(g_1^\* = g_2^\* = g_3^\* = 2\\)。
"""
