description = """
## 抽象博弈3
给定以下博弈的标准式。

（1）使用重复剔除分析，不会被剔除的战略有`填空1`。（1.5分）

（2）使用划线法分析，纯战略纳什均衡为`填空2`。（1.5分）

| 参与人1/参与人2 |	L | C | R |
| -- | -- | -- | -- |
| T	| 2, 0 | 1, 1 | 4, 2 |
| M | 3, 4 | 1, 2 | 2, 3 |
| B	| 1, 3 | 0, 2 |	3, 0 |

"""

math_template = """
（1）填空1：

（2）填空2：
"""

knowledge = []

title = "抽象博弈3（3分）"
score = 3

answer = """
（1）对于参与人1来说，战略B严格劣于T（2>1, 1>0, 4>3），剔除掉B。
对于参与人2来说，在剩下T、M中，战略C严格劣于R（R收益为2、3，C收益为1、2），剔除掉C。
剩余战略T、M、L、R均不会被剔除。

（2）使用划线法分析的收益矩阵如下：

| 参与人1/参与人2 | L | C | R |
| :---: | :---: | :---: | :---: |
| T | 2, 0 | <u>1</u>, 1 | <u>4</u>, <u>2</u> |
| M | <u>3</u>, <u>4</u> | <u>1</u>, 2 | 2, 3 |
| B | 1, <u>3</u> | 0, 2 | 3, 0 |

该博弈问题的纯战略纳什均衡为（T，R）、（M，L）。
"""
