description = r"""
## n人古诺博弈
n人古诺博弈：假设古诺模型中有\\(n\\)家厂商，\\(q_i \\)为厂商的产量，\\(Q=\sum_{i=1}^{n} q_i \\)为市场总产量。\\(P\\)为市场出清价格，且已知\\(P=P(Q) = a-Q\\)（当\\(Q<a\\)时，否则\\(P=0\\)）。假设厂商生产没有固定成本，并且边际成本为常数c。

提示： 固定成本是指在一定产量范围内，不随产量的增减而变化的成本。例如，租金、管理人员工资、折旧费用等。边际成本是指生产额外一单位产品时所增加的总成本。它是总成本对产量的导数。


（1）根据问题的假设可知各厂商的收益函数为 （2分）

$$
\pi_i(q_1,\cdots,q_n)=[[填空1]]
$$

其中\\(i=1,2,...,n\\)。

（2）n人古诺博弈的纳什均衡中，\\(q_i^*\\)的取值为：`填空2`。（3分）
"""

math_template = """
（1）填空1: [];

（2）填空2: []。
"""

knowledge = []

title = "n人古诺博弈（5分）"
score = 5

answer = r"""
（1）第i家厂商的收益函数为：
$$
\pi_i(q_1, \dots, q_n) = q_i(a - Q - c) = q_i(a - (\sum_{i=1}^n q_i) - c)
$$
因此填空1为：q_i(a - (\sum_{i=1}^n q_i) - c)。

（2）由纳什均衡的定义可知，厂商i的最优产量\(q_i^*\)为下面最优化问题的解：
$$
\max_{q_i \geq 0} \pi_i(q_1^*, \dots, q_{i-1}^*, q_i, q_{i+1}^*, \dots, q_n^*)
$$
求解上述最优化问题，对\(q_i\)求一阶导数并令其为0（一阶条件）：
$$
\frac{\partial \pi_i}{\partial q_i} = a - (\sum_{j=1, j \neq i}^n q_j^*) - c - 2q_i = 0
$$
二阶条件满足 \(\frac{\partial^2 \pi_i}{\partial q_i^2} = -2 < 0\)。

由对称性可知所有厂商的均衡产量相等，即 \(q_1^* = q_2^* = \dots = q_n^* = q^*\)。
代入一阶条件方程：
$$
a - (n-1)q^* - c - 2q^* = 0
$$
$$
a - c = (n+1)q^*
$$
解得：
$$
q^* = \frac{a-c}{n+1}
$$
因此填空2为：\frac{a-c}{n+1}。
"""
